app/controllers/articles_controller.rb

	def update
		@article=Article.find(params[:id])
		if @article.update_attributes(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "articles" SET "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["text", "asaf\r\nzcxzxczcx"], ["updated_at", "2016-02-08 22:11:41.086537"], ["id", 1]]