app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT 1  [["id", 7]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "asdf"], ["body", "hahahaha"], ["article_id", 7], ["created_at", "2016-02-09 17:24:41.643880"], ["updated_at", "2016-02-09 17:24:41.643880"]]
---
	def create
		@article= Article.find(params[:article_id])
		@comment= @article.comments.create(comments_params)